### SQL in 10 Minutes
#### Lesson II

In [1]:
import sqlite3 
import pandas as pd

In [2]:
db = 'tysql.sqlite'
conn = sqlite3.connect(db)

Here we make it even simpler to list all tables for sqlite3 using pandas compared to our Intro notebook

In [3]:
tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = 'table';""", conn)

In [8]:
tables

,type,name,tbl_name,rootpage,sql
0,table,Customers,Customers,2,CREATE TABLE Customers\n(\n cust_id char...
1,table,OrderItems,OrderItems,4,CREATE TABLE OrderItems\n(\n order_num int ...
2,table,Orders,Orders,7,CREATE TABLE Orders\n(\n order_num int ...
3,table,Products,Products,10,CREATE TABLE Products\n(\n prod_id char(10...
4,table,Vendors,Vendors,12,CREATE TABLE Vendors\n(\n vend_id char(1...

In [7]:
tables['name'].reset_index()

   index        name
0      0   Customers
1      1  OrderItems
2      2      Orders
3      3    Products
4      4     Vendors